<?php

use yii\db\Migration;

/**
 * Class m180629_105826_create_tables
 */
class m180629_105826_create_tables extends Migration
{
    /**
     * {@inheritdoc}
     */
    public function safeUp()
    {
		$this->createTable('objects', [
            'iMObjectID' => $this->primaryKey(),
            'sAddress' => $this->string(255)->notNull(),
            'sName' => $this->string(255)->notNull(),
            'sImageFileName' => $this->string(255)->notNull(),
        ]);
		$this->createTable('blocks', [
            'iMBlockID' => $this->primaryKey(),
            'iMObjectID' => $this->integer()->notNull(),
            'iFloor' => $this->integer()->notNull(),
            'iArea' => $this->integer()->notNull(),
            'iPricePerYear' => $this->integer()->notNull(),
            'iPricePerMonth' => $this->integer()->notNull(),
        ]);
        $this->batchInsert('objects', 
        	['sAddress', 'sName', 'sImageFileName'],
        	[
        		['Садовническая ул. д. 82 стр. 2', 'Бизнес-центр Аврора', '1.jpg'],
        		['Дербеневская набережная, 11', 'Бизнес-центр Полларс', '2.jpg'],
        		['Ленинградский проспект, 72', 'БЦ «Алкон»', '3.jpg'],
        		['ул. Правды д. 26', 'Бизнес-центр СЕВЕРНОЕ СИЯНИЕ', '4.jpg'],
        		['ул. Профсоюзная, д. 65', 'БЦ Лотте', '5.jpg'],
        		
        		['Садовническая ул. д. 82 стр. 2', 'Бизнес-центр Аврора 2', '1.jpg'],
        		['Дербеневская набережная, 11', 'Бизнес-центр Полларс 2', '2.jpg'],
        		['Ленинградский проспект, 72', 'БЦ «Алкон» 2', '3.jpg'],
        		['ул. Правды д. 26', 'Бизнес-центр СЕВЕРНОЕ СИЯНИЕ 2', '4.jpg'],
        		['ул. Профсоюзная, д. 65', 'БЦ Лотте 2', '5.jpg'],

        		['Садовническая ул. д. 82 стр. 2', 'Бизнес-центр Аврора 3', '1.jpg'],
        		['Дербеневская набережная, 11', 'Бизнес-центр Полларс 3', '2.jpg'],
        		['Ленинградский проспект, 72', 'БЦ «Алкон» 3', '3.jpg'],
        		['ул. Правды д. 26', 'Бизнес-центр СЕВЕРНОЕ СИЯНИЕ 3', '4.jpg'],
        		['ул. Профсоюзная, д. 65', 'БЦ Лотте 3', '5.jpg'],
        	]
        );
        $this->batchInsert('blocks', 
        	['iMObjectID', 'iFloor', 'iArea', 'iPricePerYear', 'iPricePerMonth'],
        	[
	        	[1, 1, 300, 360000, 30000],
	        	[1, 2, 200, 360000, 20000],
	        	[2, 1, 100, 400000, 31000],
	        	[2, 2, 100, 400000, 32000],
	        	[2, 3, 100, 400000, 33000],
	        	[3, 1, 70, 200000, 20000],
	        	[3, 2, 100, 200000, 20000],
	        	[4, 1, 80, 100000, 10000],
	        	[4, 3, 80, 100000, 10000],
	        	[5, 1, 50, 500000, 50000],
	        	[5, 5, 50, 500000, 50000],	        	

	        	[6, 1, 123, 360000, 30000],
	        	[6, 2, 456, 360000, 20000],
	        	[7, 1, 678, 400000, 31000],
	        	[7, 2, 910, 400000, 32000],
	        	[7, 3, 111, 400000, 33000],
	        	[8, 1, 213, 200000, 20000],
	        	[8, 2, 141, 200000, 20000],
	        	[9, 1, 516, 100000, 10000],
	        	[9, 3, 17, 100000, 10000],
	        	[10, 1, 18, 500000, 50000],
	        	[10, 5, 19, 500000, 50000],
	        	
	        	[11, 1, 100, 100000, 30000],
	        	[11, 2, 200, 200000, 20000],
	        	[12, 1, 300, 300000, 31000],
	        	[12, 2, 400, 300000, 32000],
	        	[12, 3, 500, 400000, 33000],
	        	[13, 1, 600, 400000, 20000],
	        	[13, 2, 700, 500000, 20000],
	        	[14, 1, 80, 500000, 10000],
	        	[14, 3, 80, 600000, 10000],
	        	[15, 1, 90, 600000, 50000],
	        	[15, 5, 90, 600000, 50000],	        	
        	]
        );
    }

    /**
     * {@inheritdoc}
     */
    public function safeDown()
    {
        $this->dropTable('MObjects');
        $this->dropTable('MBlocks');
    }

    /*
    // Use up()/down() to run migration code without a transaction.
    public function up()
    {

    }

    public function down()
    {
        echo "m180629_105826_create_tables cannot be reverted.\n";

        return false;
    }
    */
}
